Ran Plan for dir: `live/dev/webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
~ resource "aws_autoscaling_group" "this" {
        arn                       = "arn:aws:autoscaling:eu-west-2:565938106136:autoScalingGroup:856de8ce-5a9e-43bf-92a4-35878e8531dd:autoScalingGroupName/tf-asg-20200518125623139600000002"
        availability_zones        = [
            "eu-west-2a",
            "eu-west-2b",
            "eu-west-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
        id                        = "tf-asg-20200518125623139600000002"
      ~ launch_configuration      = "terraform-20200518125622464700000001" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 4
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "tf-asg-20200518125623139600000002"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::565938106136:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:eu-west-2:565938106136:targetgroup/tf-atlantis-atlantis/ce86e2ff77718540",
        ]
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-273ae16b",
            "subnet-7fc85c05",
            "subnet-d5367ebc",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "tf-atlantis"
        }
    }

  # module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-west-2:565938106136:launchConfiguration:c3ad0ebc-b74a-484a-9594-a65a10c21dca:launchConfigurationName/terraform-20200518125622464700000001" -> (known after apply)
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
        iam_instance_profile             = "ora2postgres_atlantis"
      ~ id                               = "terraform-20200518125622464700000001" -> (known after apply)
        image_id                         = "ami-01a6e31ac994bbc09"
        instance_type                    = "t2.micro"
        key_name                         = "atlantis"
      ~ name                             = "terraform-20200518125622464700000001" -> (known after apply)
      ~ security_groups                  = [
          - "sg-0013900158c3c0a88",
          - "sg-095c3058277a65b70",
          - "sg-0f3d6e5cbd7d24079",
        ] -> (known after apply) # forces replacement
      ~ user_data                        = "d6cb3d1dd46d55d2e560eff5b49d80088155acd1" -> "ee162c4445228a207ea79b5e6caae7082065c3b7" # forces replacement
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.asg.aws_security_group.web will be created
+ resource "aws_security_group" "web" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "tf-atlantis-web"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

  # module.asg.aws_security_group_rule.allow_web will be created
+ resource "aws_security_group_rule" "allow_web" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 3 to add, 1 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://tf-atlantis-alb-1729649540.eu-west-2.elb.amazonaws.com/events/lock?id=baranovRP%252Ftf-aws-rnbv-complex%252Flive%252Fdev%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
